In [5]:
#dependencies

import pandas as pd

In [6]:
#Use Pandas to read data
avocado_sales_2015 = pd.read_csv("../Resources/clean_avocado.csv")

In [7]:
#print to view
avocado_sales_2015.head()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
0,0,1/4/2015,1.22,40873.28,2819.50,28287.42,49.90,9716.46,9186.93,529.53,0.0,conventional,2015,Albany
1,1,1/11/2015,1.24,41195.08,1002.85,31640.34,127.12,8424.77,8036.04,388.73,0.0,conventional,2015,Albany
2,2,1/18/2015,1.17,44511.28,914.14,31540.32,135.77,11921.05,11651.09,269.96,0.0,conventional,2015,Albany
3,3,1/25/2015,1.06,45147.50,941.38,33196.16,164.14,10845.82,10103.35,742.47,0.0,conventional,2015,Albany
4,4,2/1/2015,0.99,70873.60,1353.90,60017.20,179.32,9323.18,9170.82,152.36,0.0,conventional,2015,Albany

In [8]:
#look for missing values
#awesome to see!
avocado_sales_2015.count()

Unnamed: 0      18722
Date            18722
AveragePrice    18722
Total Volume    18722
4046            18722
4225            18722
4770            18722
Total Bags      18722
Small Bags      18722
Large Bags      18722
XLarge Bags     18722
type            18722
year            18722
region          18722
dtype: int64

In [9]:
#get a list of all of our columns for easy reference
avocado_sales_2015.columns

Index(['Unnamed: 0', 'Date', 'AveragePrice', 'Total Volume', '4046', '4225',
       '4770', 'Total Bags', 'Small Bags', 'Large Bags', 'XLarge Bags', 'type',
       'year', 'region'],
      dtype='object')

In [ ]:
#notes -

#need to remove unnamed
#do total volume in 2015 by major city by 'year' and 'region'

In [10]:
#collect data that includes year 2015 - all cities
#'year' == 2015

avocado_sales_2015_df = avocado_sales_2015.loc[(avocado_sales_2015["year"] == 2015)]

In [11]:
#print
avocado_sales_2015_df

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
0,0,1/4/2015,1.22,40873.28,2819.50,28287.42,49.90,9716.46,9186.93,529.53,0.0,conventional,2015,Albany
1,1,1/11/2015,1.24,41195.08,1002.85,31640.34,127.12,8424.77,8036.04,388.73,0.0,conventional,2015,Albany
2,2,1/18/2015,1.17,44511.28,914.14,31540.32,135.77,11921.05,11651.09,269.96,0.0,conventional,2015,Albany
3,3,1/25/2015,1.06,45147.50,941.38,33196.16,164.14,10845.82,10103.35,742.47,0.0,conventional,2015,Albany
4,4,2/1/2015,0.99,70873.60,1353.90,60017.20,179.32,9323.18,9170.82,152.36,0.0,conventional,2015,Albany
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
18516,26359,11/29/2015,1.73,1685.80,791.50,8.85,0.00,885.45,885.45,0.00,0.0,organic,2015,Tampa
18517,26360,12/6/2015,1.76,1739.62,919.89,16.40,0.00,803.33,803.33,0.00,0.0,organic,2015,Tampa
18518,26361,12/13/2015,1.76,1844.95,947.72,25.19,0.00,872.04,872.04,0.00,0.0,organic,2015,Tampa
18519,26362,12/20/2015,1.79,2078.74,1214.10,11.31,0.00,853.33,853.33,0.00,0.0,organic,2015,Tampa
18520,26363,12/27/2015,1.63,2161.84,874.75,17.54,0.00,1269.55,1216.67,52.88,0.0,organic,2015,Tampa

In [12]:
#drop column "Unnamed: 0"
#add at end inplace=True -> to allow panda to edit the original DF
avocado_sales_2015_df.drop(columns=["Unnamed: 0"], inplace=True)

In [13]:
#print to view
avocado_sales_2015_df

,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
0,1/4/2015,1.22,40873.28,2819.50,28287.42,49.90,9716.46,9186.93,529.53,0.0,conventional,2015,Albany
1,1/11/2015,1.24,41195.08,1002.85,31640.34,127.12,8424.77,8036.04,388.73,0.0,conventional,2015,Albany
2,1/18/2015,1.17,44511.28,914.14,31540.32,135.77,11921.05,11651.09,269.96,0.0,conventional,2015,Albany
3,1/25/2015,1.06,45147.50,941.38,33196.16,164.14,10845.82,10103.35,742.47,0.0,conventional,2015,Albany
4,2/1/2015,0.99,70873.60,1353.90,60017.20,179.32,9323.18,9170.82,152.36,0.0,conventional,2015,Albany
...,...,...,...,...,...,...,...,...,...,...,...,...,...
18516,11/29/2015,1.73,1685.80,791.50,8.85,0.00,885.45,885.45,0.00,0.0,organic,2015,Tampa
18517,12/6/2015,1.76,1739.62,919.89,16.40,0.00,803.33,803.33,0.00,0.0,organic,2015,Tampa
18518,12/13/2015,1.76,1844.95,947.72,25.19,0.00,872.04,872.04,0.00,0.0,organic,2015,Tampa
18519,12/20/2015,1.79,2078.74,1214.10,11.31,0.00,853.33,853.33,0.00,0.0,organic,2015,Tampa
18520,12/27/2015,1.63,2161.84,874.75,17.54,0.00,1269.55,1216.67,52.88,0.0,organic,2015,Tampa

In [14]:
#export DF into a .csv
avocado_sales_2015_df.to_csv("avocado_sales_2015.csv")